export const MeestPoshtaDeliveryCodes = [
  101, 202, 303, 404, 405, 505, 606, 707, 808, 1100, 1213, 1214, 1215, 1216,
  1315, 1521, 1620, 1621, 1622, 1623, 1624, 1625, 1626, 1627, 1628, 1825, 2225,
  2226, 2230, 2331, 2432, 2533, 5051, 8081,
];

export type MeestPoshtaDeliveryCode = (typeof MeestPoshtaDeliveryCodes)[number];

export const MeestPoshtaDeliveryCodesMap = new Map<
  MeestPoshtaDeliveryCode,
  string
>([
  [101, 'Оформлено для відправки'],
  [202, 'Надходження до міжнародного сортувального центру'],
  [303, 'Відправка з сортувального центру країни відправника'],
  [404, 'Партія посилок Прибула в транзитний хаб'],
  [405, 'Партію посилок ВІдправлено з транзитного хабу'],
  [505, 'Надходження до сортувального центру країни отримувача'],
  [606, 'Надходження до підрозділу відправника'],
  [707, 'Прибуло на підрозділ повернення'],
  [
    808,
    'Відправка з міжнародного сортувального центру у напрямку міста отримувача',
  ],
  [1100, 'Прибуло в сортувальний центр'],
  [1213, 'Надходження до підрозділу отримувача'],
  [1214, 'Надходження до підрозділу отримувача'],
  [1215, 'Надійшло на підрозділ доручення'],
  [1216, 'Надійшло у відділення'],
  [1315, "Видано кур'єру"],
  [1521, 'Змінено напрямок (Відправлення буде повернуте відправнику)'],
  [1620, 'Відмова від отримання'],
  [1621, 'Спроба доручення: Переадресовано на іншу адресу'],
  [1622, 'Доручено'],
  [1623, 'Спроба доручення: Повернуто на склад'],
  [1624, 'Спроба доручення: Неможливо перевірити дані доставки'],
  [1625, 'Спроба доручення: Отримувач недоступний'],
  [1626, 'Спроба доручення: Отримувач переніс дату доставки'],
  [1627, 'Спроба доручення: Кур`єр не встиг доставити'],
  [1628, 'Спроба доручення: Неможливо підтвердити реквізити отримувача'],
  [1825, 'Повернуто відправнику'],
  [2225, 'Відправлення проходить митний догляд'],
  [2226, 'Митний догляд завершено. Відправлення буде передане на доставку'],
  [2230, 'Митне оформлення'],
  [2331, 'Доставка призупинена'],
  [2432, 'Знято обмеження в доставці'],
  [2533, 'Уточнено реквізити отримувача'],
  [5051, 'Посилка не прибула'],
  [8081, 'Відправка з підрозділу відправника'],
]);
