import { DataSource } from 'typeorm';
import { Seeder } from 'typeorm-extension';

import { FaqEntity } from '../../../entities/faq.entity';

export default class FaqSeeder implements Seeder {
  public async run(dataSource: DataSource): Promise<any> {
    const repository = dataSource.getRepository(FaqEntity);
    const faqsData: Partial<FaqEntity>[] = [
      {
        question: 'Оплата через Privat24',
        answer:
          '<p>Найбільш поширений в Україні спосіб оплати, дає можливість купувати товари в один клік, без введення номера карти, термінів дії та CVV-коду. Для оплати товару досить просто підтвердити платіж в особистому кабінеті банку.</p>',
        isPublished: true,
        order: 1,
      },
      {
        question: 'Оплата карткою Visa або MasterCard онлайн (LiqPay)',
        answer:
          '<p>LiqPay — це:</p><ul><li>Висока безпека платежів - Verified by Visa та MasterCard SecureCode.</li><li>Можливість перерахування коштів між картками/рахунками будь-яких банків світу.</li><li>Швидкість перерахування коштів - платіж проводиться практично моментально, в рідкісних випадках до 1 банківського дня.</li><li>Незалежність проведення оплат від графіка роботи відділень банку.</li></ul><p>Після натискання кнопки «Оформити замовлення» в кошику товарів Ви будете перенаправлені на форму оплати замовлення LiqPay.</p>',
        isPublished: true,
        order: 2,
      },
      {
        question: 'Післяплата при отриманні (Нова пошта, Укрпошта, Justin).',
        answer:
          '<p>Післяплата при отриманні - це оплата товару / вантажу одержувачем під час отримання посилки у відділенні перевізника, або за місцем проживання. При отриманні товару з післяплатою ви повинні сплатити вартість товару, відсоток за зворотню доставку коштів продавцю (за тарифами перевізника, орієнтовно 2% + 20 грн.) і вартість доставки.</p><p>Важливо: при даному способі оплати необхідна передоплата на картку в розмірі вартості доставки. Ми прорахуємо і повідомимо Вам перед відправкою точну суму і реквізити картки. При отриманні товару Ви сплачуєте за нього за мінусом суми передоплати.</p>',
        order: 3,
      },
    ];
    await repository.insert(faqsData);
  }
}
